#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

[command]/home/runner/work/_temp/5b900e82-46a7-4642-bd8f-3848e5b1767d/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-rLwCDKn3DN6ZWfb6

Waiting for the plan to start...

Terraform v1.5.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.quarkus_ironjacamar will be created
  + resource "github_repository" "quarkus_ironjacamar" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "IronJacamar is an implementation of the Jakarta Connector Architecture specification"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + homepage_url                = "https://some-url/"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-ironjacamar"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "jca",
          + "quarkus-extension",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
    }

  # github_repository.quarkus_systemd_notify will be updated in-place
  ~ resource "github_repository" "quarkus_systemd_notify" {
      ~ description                 = "Quarkiverse extension to integrate systemd-notify with Quarkus" -> "This project demonstrates integrating systemd-notify with Quarkus"
      ~ has_projects                = false -> true
        id                          = "quarkus-systemd-notify"
        name                        = "quarkus-systemd-notify"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_team.quarkus_ironjacamar will be created
  + resource "github_team" "quarkus_ironjacamar" {
      + create_default_maintainer = false
      + description               = "ironjacamar team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-ironjacamar"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_ironjacamar["gastaldi"] will be created
  + resource "github_team_membership" "quarkus_ironjacamar" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "gastaldi"
    }

  # github_team_membership.quarkus_univocity_parsers["aruffie"] will be created
  + resource "github_team_membership" "quarkus_univocity_parsers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4707008"
      + username = "aruffie"
    }

  # github_team_repository.quarkus_ironjacamar will be created
  + resource "github_team_repository" "quarkus_ironjacamar" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-ironjacamar"
      + team_id    = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0
```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*